Tekla Open API Reference for Tekla Structures 2025
PrintAttributes Class
 The PrintAttributes class contains the attributes for controlling the printing.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.PrintAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PrintAttributes : GenericAttributesBase
<SerializableAttribute>
Public NotInheritable Class PrintAttributes
	Inherits GenericAttributesBase
The PrintAttributes type exposes the following members.
Constructors
Name | Description
PrintAttributes
 Creates a new PrintAttributes instance.
Top
Properties
Name | Description
NumberOfCopies
 The number of copies in printing.
Orientation
 The print orientation type.
PrintArea
 The print area type.
PrinterInstance
 The name of the printer instance. Can be fetched from the printer catalog.
PrintToMultipleSheet
 Whether to print to multiple sheets.
Scale
 The scale factor.
ScalingType
 The scale type.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace